main.floors.MT1=
{
    "floorId": "MT1",
    "title": "划水区 1层",
    "name": "1",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "item_ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [
        "\t[hero]？？？",
        "\t[hero]哪来的堵路蝙蝠，根本打不过（无法接受.jpg）",
        "\t[hero]不对，时代变了，我有箭，看我社保它",
        "提示：直接快速滑动就能射击，不需要按键。手机端手滑，pc端鼠标滑动均可",
        "提示：红宝石可增加攻击力，蓝宝石可增加防御力，绿宝石可增加魔防，本塔可自由切换换伤或者普通战斗（有无弓箭装备区分）",
        "提示：射击时，攻击增加射击伤害，伤害计算为：系数*攻击力，真伤，后续会继续补充说明；换伤时，防御力可抵免对面第一次攻击的伤害；魔防则可以战后回血，但是较珍贵；卸下弓箭后的正常战斗规则同其他塔",
        {
            "type": "setValue",
            "name": "flag:enableGesture",
            "value": "true"
        },
        {
            "type": "comment",
            "text": "我猜你打开了工程（废话）"
        },
        {
            "type": "comment",
            "text": "上面那条用于打开画线手势命令开关"
        },
        {
            "type": "comment",
            "text": "首次射击事件在公共事件里"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "5,7": [
            "本塔用相当数量的机关门，为方便玩家，采用特殊地板来标注出机关点，对应位置上有怪物杀死可触发，但是，一点仅可触发一次，如下面的机关门就需触发下面两个位置的点，快咸蓝啊！",
            "请学会引怪！\n请学会引怪！！\n请学会引怪！！！",
            "另外，左下方的捕捉怪是个问题，不同于其他怪，它是移动后会进行一次捕捉，通常，射击时请与他保持3格及以上距离，此处需特殊应对，果断，就会白给"
        ],
        "5,10": [
            "如果对为什么机关用水来标记有疑问。。编辑器没做啊（哭）"
        ]
    },
    "changeFloor": {
        "6,0": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "10,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "afterBattle": {
        "5,9": [
            {
                "type": "if",
                "condition": "flag:11==0",
                "true": [
                    {
                        "type": "addValue",
                        "name": "flag:11",
                        "value": "1"
                    },
                    {
                        "type": "addValue",
                        "name": "flag:1",
                        "value": "1"
                    },
                    {
                        "type": "if",
                        "condition": "flag:1==2",
                        "true": [
                            {
                                "type": "openDoor",
                                "loc": [
                                    6,
                                    10
                                ]
                            },
                            {
                                "type": "setBgFgBlock",
                                "name": "bg",
                                "number": "0"
                            }
                        ],
                        "false": []
                    }
                ],
                "false": []
            }
        ],
        "7,9": [
            {
                "type": "if",
                "condition": "flag:12==0",
                "true": [
                    {
                        "type": "addValue",
                        "name": "flag:12",
                        "value": "1"
                    },
                    {
                        "type": "addValue",
                        "name": "flag:1",
                        "value": "1"
                    },
                    {
                        "type": "if",
                        "condition": "flag:1==2",
                        "true": [
                            {
                                "type": "openDoor",
                                "loc": [
                                    6,
                                    10
                                ]
                            },
                            {
                                "type": "setBgFgBlock",
                                "name": "bg",
                                "number": "0"
                            }
                        ],
                        "false": []
                    }
                ],
                "false": []
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
    [  1,  1,  1,  1,  1,  1, 88,  1,  1,  1,  1,  1,  1],
    [  1, 31,202,  0,  0,  1,  0,  1,  0,206,  0, 32,  1],
    [  1,  1,  0,  1,  0,  1,  0,  1, 31,  1,  1,  1,  1],
    [  1,  0,  0,201,  0,  0,205,  0,  0,  0,  1, 22,  1],
    [  1,201,  1,  0,  1,  1,  0,  1,  1,201,  1,  0,  1],
    [  1,  0,  1,201,  0,  1,  0,  1, 21,  0,  0,202,  1],
    [  1, 21,  1,  0, 31,  0,202,  0,  0,  1,  1,  0,  1],
    [  1,  0,201,  0,  1,129,  0,  1,201,  0, 31,  0,  1],
    [  1,  0,  1,  1,  1,  0, 81,  1,  0,  1,  1, 81,  1],
    [  1, 32,  0,  0,  0,  0,  0,  0, 82,  0,219,  0,  1],
    [  1,  0,207,  0,  0,  1, 85,  1,  0, 63,  0, 31,  1],
    [  1,  1,  0, 33,  1, 27, 29, 28,  1,  0, 87,  0,  1],
    [  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0, 16,  0, 16,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0, 85,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0, 94,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
]
}